ext_alsav/InformationRegisters/алсав_КлючиСекретов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>алсав_КлючиСекретов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ext_alsav/InformationRegisters/алсав_КлючиСекретов/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
		
КонецПроцедуры

&НаСервере
Процедура ПоказатьЗначениеСекретаНаСервере(КлючСекрета) Экспорт 
	Запись = РегистрыСведений.алсав_КлючиСекретов.ПолучитьПоследнее(Новый Структура("Ключ", КлючСекрета));
	Если Запись <> Неопределено Тогда
		ЗначениеСекрета = Запись.Значение;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// Проверяем заполненность обязательных полей
	Если ПустаяСтрока(Запись.Ключ) Тогда
		ПоказатьПредупреждение(, "Необходимо указать ключ секрета!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
// Проверяем значение секрета на сервере
	ПроверитьЗначениеСекретаПередЗаписью();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПослеЗаписи()
	
	ПоказатьОповещениеПользователя("Сохранение", , "Секрет '" + Запись.Ключ + "' успешно сохранен!", БиблиотекаКартинок.Информация32);
	
	// После сохранения скрываем значение для безопасности
	ЗначениеСекрета = "******";
	
КонецПроцедуры



&НаСервере
Процедура ПроверитьЗначениеСекретаПередЗаписью()
	// Сохраняем значение в запись
	Запись.Значение = ЗначениеСекрета;
КонецПроцедуры


&НаСервере
Процедура ЗагрузитьЗначениеСекрета()
	Если Запись.Пустая() Или ПустаяСтрока(Запись.Ключ) Тогда
		Возврат;
	КонецЕсли;
	
	Запись = РегистрыСведений.алсав_КлючиСекретов.ПолучитьПоследнее(Новый Структура("Ключ", Запись.Ключ));
	Если Запись <> Неопределено Тогда
		ЗначениеСекрета = Запись.Значение;
		ЗначениеСекретаСкрыто = Ложь; // Значение загружено и должно быть видимым
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// Вставить содержимое обработчика.
	ЗагрузитьЗначениеСекрета();
КонецПроцедуры
